let a = +prompt("Nhập số điện vào") ; 
if(a<=50) {
    console.log(a*1678) ; 
}
else if (a>=51 && a<=100) {
    console.log(50*1678 + (a-50)*1734) ; 
}
else if (a>=101 && a<=200) {
    console.log(50*1678 + 50*1734 + (a-100)*2014) ; 
}
else if (a>=201 && a<=300) {
    console.log(50*1678 + 50*1734 + 100*2014 + (a-200)*2536) ; 
}
else if (a>=301 && a<=400) {
    console.log(50*1678 + 50*1734 + 100*2014 + 100*2536 + (a-300)*2834 ) ; 
}
else {
    console.log(50*1678 + 50*1734 + 100*2014 + 100*2536 + 100*2834 + (a-400)* 2927) ; 
}